
&НаСервере
Процедура ПечатьНаСервере(ТабДокумент)
	
	ОбъектыПечати = Новый СписокЗначений;

	МассивОбъектов = ОбъектСсылка.ВыгрузитьЗначения();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	МакетПечати = ОбработкаОбъект.ПолучитьМакет("ПФ_MXL_АктОСписанииТоваров");
	ТабДокумент = ОбработкаОбъект.СформироватьПечатнуюФормуАктСписанияТоваров(МассивОбъектов, ОбъектыПечати, МакетПечати);
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)

	ТабДокумент = Новый ТабличныйДокумент;
	
	ПечатьНаСервере(ТабДокумент);
	
	ТабДокумент.Показать();

КонецПроцедуры
