
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Продажи.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		// регистр Продажи 
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовары.Товар;
		Движение.Клиент = Клиент;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Цена = ТекСтрокаТовары.Цена;

		// регистр ОстаткиТоваров Расход
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Клиент;
		Движение.Товар = ТекСтрокаТовары.Товар;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Цена = ТекСтрокаТовары.Цена;
		
	КонецЦикла;
	Движения.Записать();
	
	// регистр ПартииТоваров Расход
	Движения.ПартииТоваров.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТовары.Товар КАК Товар,
		|	СУММА(РеализацияТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.Реализация.Товары КАК РеализацияТовары
		|ГДЕ
		|	РеализацияТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТовары.Товар
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Товар КАК Товар,
		|	ВТ.Количество КАК Количество,
		|	ПартииТоваровОстатки.Партия КАК Партия,
		|	ЕСТЬNULL(ПартииТоваровОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ПартииТоваровОстатки.СуммаОстаток, 0) КАК СуммаОстаток
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваров.Остатки(
		|				&МоментВремени,
		|				Товар В
		|					(ВЫБРАТЬ
		|						ВТ.Товар КАК Товар
		|					ИЗ
		|						ВТ КАК ВТ)) КАК ПартииТоваровОстатки
		|		ПО ВТ.Товар = ПартииТоваровОстатки.Товар
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПартииТоваровОстатки.Партия.МоментВремени
		|ИТОГИ
		|	МАКСИМУМ(Количество),
		|	СУММА(КоличествоОстаток),
		|	СУММА(СуммаОстаток)
		|ПО
		|	Товар,
		|	Партия";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТовар = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТовар.Следующий() Цикл
	
		КоличествоСписать = ВыборкаТовар.Количество;
		ВыборкаПартия = ВыборкаТовар.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаПартия.Следующий() И КоличествоСписать <> 0 Цикл
	
			ВыборкаДетальныеЗаписи = ВыборкаПартия.Выбрать();
	
			КоличествоОстаток = ВыборкаПартия.КоличествоОстаток;
			СуммаОстаток = ВыборкаПартия.СуммаОстаток;

			Количество = Мин(КоличествоСписать, КоличествоОстаток);
			Если КоличествоСписать = КоличествоОстаток Тогда
				Сумма = СуммаОстаток;
			Иначе
				Сумма = Количество * СуммаОстаток / КоличествоОстаток;
			КонецЕсли;

			Движение = Движения.ПартииТоваров.ДобавитьРасход();
			Движение.Товар = ВыборкаТовар.Товар;
			Движение.Период = Дата;
			Движение.Партия = ВыборкаПартия.Партия;
			Движение.Количество = Количество;
			Движение.Сумма = Сумма;
			
			КоличествоСписать = КоличествоСписать -  Количество;
			
		КонецЦикла;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА




КонецПроцедуры
